app/Filters/Auth.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '31'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('/login')->with('msg', 'Debes iniciar sesion');
        }



        $id_usuario = $session->get('id_usuario');