app/Controllers/carrito_controller.php

SELECT *
FROM `ventas`
WHERE `usuario_id` = '31'
ORDER BY `id` DESC
 LIMIT 1
INSERT INTO `ventas` (`fecha`, `usuario_id`, `total_venta`, `tipoPago_id`, `tarjeta`, `nombre`, `expira`, `cvc`) VALUES ('2024-06-20 00:46:15', '31', 12500, '2', '2020202020202020', ' Jon Snow', '2024-06-28', '123')
---

        // Registra la compra
        $ventasModel = new Ventas_model();
        $ventaId = $ventasModel->insert([
            'fecha' => date('Y-m-d H:i:s'),
            'usuario_id' => $session->get('id_usuario'),
            'total_venta' => $cart->total(),
            'tipoPago_id' => $tipoPago_id,
            'tarjeta' => $tarjeta,
            'nombre' => $nombre,
            'expira' => $expira,
            'cvc' => $cvc,
        ]);

INSERT INTO `ventas_detalle` (`venta`, `producto`, `cantidad`, `precio`) VALUES (31, '18', 1, '12500.00')
---
        // Inserta detalles de la venta
        $ventasDetalle = new VentasDetalle_model();
        foreach ($productos as $item) {
            $ventasDetalle->insert([
                'venta' => $ventaId,
                'producto' => $item['id_producto'],
                'cantidad' => $item['qty'],
                'precio' => $item['precio_vta'],
            ]);