app/Controllers/CatalogoController.php

SELECT *
FROM `productos`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `productos`
---
    public function index() {
        // Devolver una vista donde muestres links con cada categoría
        // URNAS -> catalogo/1
        // Joyas -> catalogo/2
        // ...

        $model = new productos_model();

        $data = [
            'productos' => $model->paginate(6),
            'pager' => $model->pager,
        ];

SELECT *
FROM `productos`
WHERE `categoria_id` = '2'
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `categoria_id` = '2'
---
    public function categories($categoria_id = 1) {
        $model = new productos_model();
        $data = [
            'productos' => $model->where('categoria_id', $categoria_id)->paginate(6),
            'pager' => $model->pager,
        ];

SELECT *
FROM `ventas`
WHERE `usuario_id` = '31'
 LIMIT 10, 5
SELECT COUNT(*) AS `numrows`
FROM `ventas`
WHERE `usuario_id` = '31'
SELECT *
FROM `ventas_detalle`
WHERE `venta` = '28'
---
    public function verHistorialCompras()
    {
        $session = session();
        $usuarioId = $session->get('id_usuario');

        if (!$usuarioId) {
            return redirect()->to('login')->with('error', 'Debe iniciar sesión para acceder a su historial de compras.');
        }

        // Obtener todas las ventas del usuario con paginación
        $ventasModel = new Ventas_model();
        $ventas = $ventasModel->where('usuario_id', $usuarioId)->paginate(5); // Cambia 5 por el número de ventas que quieras por página
        $pager = $ventasModel->pager;

        // Obtener detalles de cada venta
        $ventasDetalleModel = new VentasDetalle_model();
        $productosModel = new Productos_model();

        $ventasConDetalles = [];

        foreach ($ventas as $venta) {
            $detallesVenta = $ventasDetalleModel->where('venta', $venta['id'])->findAll();