app/Controllers/CatalogoController.php

SELECT *
FROM `productos`
 LIMIT 5, 5
---
    public function index() {
        // Devolver una vista donde muestres links con cada categoría
        // URNAS -> catalogo/1
        // Joyas -> catalogo/2
        // ...

        $model = new productos_model();

        $data = [
            'productos' => $model->paginate(5),
            'pager' => $model->pager,
        ];