app/Controllers/consultas_controller.php

    public function index(){

        $modelConsultas = new consultas_model();
        $modelConsultasProd = new consultasProd_model();

        $data['consultas'] = $modelConsultas->findAll();
        $data['consultasprod'] = $modelConsultasProd->findAll();
---
SELECT *
FROM `consultas`
SELECT *
FROM `consultasprod`

    public function save(){

        $model = new consultas_model();

        $data = [
            'nombre' => $this->request->getPost('nombre'),
            'apellido' => $this->request->getPost('apellido'),
            'email' => $this->request->getPost('email'),
            'mensaje' => $this->request->getPost('mensaje')
        ];

        if($model->save($data)){
---
INSERT INTO `consultas` (`nombre`, `apellido`, `email`, `mensaje`) VALUES ('carl', 'grimes', 'carl@grimes.com', 'lol')