app/Controllers/Home.php

   public function urnas() {

      // Instancia del modelo de usuarios
      $model = new productos_model();

      // Obtener todos los usuarios
      $data['productos'] = $model->findAll();
---
SELECT *
FROM `productos`

   public function joyeria() {

      $model = new productos_model();

      $data['productos'] = $model->findAll();
---
SELECT *
FROM `productos`