app/Controllers/login_controller.php

    public function auth(){

        $session = session(); //el objeto de sesión se asigna a la variable $session
        $model = new usuarios_model(); //instanciamos el modelo

        //traemos los datos del formulario
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('pass');

        $data = $model->where('username', $username)->first(); //consulta sql

        if($data){

            $pass = $data['pass'];
               $ba= $data['baja'];

                if ($ba == 'SÍ'){
                     $session->setFlashdata('msg', 'Tu cuenta se encuentra desactivada, contacta al administrador.');
                     return redirect()->to('/login');
                 }
                     //Se verifican los datos ingresados para iniciar, si cumple la verificaciòn inicia la sesion
                     $verify_pass = password_verify($password, $pass);

                   //password_verify determina los requisitos de configuracion de la contraseña
                   if($verify_pass){
                    $model->update($data['id_usuario'], ['logged_in' => 1]);
---
UPDATE `usuarios` SET `logged_in` = 1
WHERE `usuarios`.`id_usuario` IN ('32')