app/Controllers/productos_controller.php

    public function index()
    {
        // Instancia del modelo de usuarios
        $model = new productos_model();

        // Obtener todos los usuarios
        $data['productos'] = $model->findAll();
---
SELECT *
FROM `productos`