app/Controllers/usuarios_controller.php

    public function index()
    {
        // Instancia del modelo de usuarios
        $model = new usuarios_model();

        // Obtener todos los usuarios
        $data['usuarios'] = $model->findAll();
---
SELECT *
FROM `usuarios`

    public function updateP($id)
    {
        // Obtener datos del formulario
        $data = [
            'nombre' => $this->request->getPost('nombre'),
            'apellido' => $this->request->getPost('apellido'),
            'username' => $this->request->getPost('username'),
            'email' => $this->request->getPost('email'),
            'domicilio' => $this->request->getPost('domicilio'),
            'postal' => $this->request->getPost('postal'),
            'telefono' => $this->request->getPost('telefono'),
        ];

        //Instancia del modelo de usuarios
        $model = new usuarios_model();

        //Actualizar usuario
        $model->update($id, $data);
---
UPDATE `usuarios` SET `nombre` = 'Arya', `apellido` = 'Stark', `username` = 'LordCommander', `email` = 'arya@stark.com', `domicilio` = 'winterfell', `postal` = '123', `telefono` = '789456456'
WHERE `usuarios`.`id_usuario` IN ('33')