app/Models/productos_model.php

UPDATE `productos` SET `stock` = 30
WHERE `productos`.`id_producto` IN ('18')
---
    public function updateCantidad($id, $nueva_cantidad)
    {
        $data = ['stock' => $nueva_cantidad];
        $this->update($id, $data);